<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"e2cdb9dc47d8de44ce2477b7b72996ac2146b102030e31d896c19de98d8a382e","plan_job_ref":"Job Test actions using target and replace #467 at https://github.com/dflook/terraform-github-actions/actions/runs/13927779965","plan_out_hash":"22d7b775d58422566858ebeeb14ce807496b6dd78bfbb9d66b4eebcc7fa8043a","plan_hash":"d5a1bd121ef934eaee877e8ebf26db260528c4c5ab01be01ce27d821c4df6d28","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "8pfx0lFqgN" -> (known after apply)
!~  foreach = "yRSun6STYv" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #467](https://github.com/dflook/terraform-github-actions/actions/runs/13927779965)